//
// Created by ema on 1.12.25.
//
#include <iostream>
using namespace std;

// Потребно е да се пронајдат и избројат сите појавувања на обликот „Х“ составен само
// од елементите со вредност 1. Обликот „Х“ е составен од 5 елементи со вредност 1 кои се
// соодветно распределни во матрицата
// (елемент со вредност 1 кој има елементи со вредност 1 како негови дијагонални соседи).
// Од стандарден влез се вчитуваат димензиите на една матрица и елементите на истата.
// Потребно е да ги изброите сите појавувања на обликот „Х“ во рамките на матрицата.
// Да се претпостави дека не смее да има поклопување на елементите од два облика „Х“ (пример 2).
// Појавувањата на обликот „Х“ се бараат одлево-надесно и одгоре-надоле.

int main() {

    int matrix[100][100];
    int n,m;
    cin>>m>>n;
    int pluses[100][100];

    for(int i=0; i<m; i++) {
        for(int j=0; j<n; j++) {
            cin>>matrix[i][j];
            pluses[i][j]=0;
        }
    }
    int counter = 0;
    for(int i=1; i<m-1; i++) {
        for(int j=1; j<n-1; j++) {
            if(matrix[i][j]==1 &&
                matrix[i-1][j]==1 &&
                matrix[i+1][j]==1 &&
                matrix[i][j-1]==1 &&
                matrix[i][j+1]==1) {
                if(pluses[i][j]==0 && pluses[i-1][j]==0 && pluses[i+1][j]==0 && pluses[i][j-1]==0 && pluses[i][j+1]==0) {
                    counter++;
                    pluses[i][j] = pluses[i-1][j] = pluses[i+1][j] = pluses[i][j-1] = pluses[i][j+1] = 1;
                }
                }
        }
    }
    cout<<counter;
    return 0;
}