//
// Created by ema on 13.10.25.
//
//Да се напише програма каде од тастатура ќе се внесе датумот на раѓање во формат (ddmmgggg). Програмата на компјутерскиот екран ќе го испечати денот и месецот на раѓање.
//
//Пример: Ако се внесе следниот број: 18091992, програмата ќе испечати: 18.9
//ПОМОШ: Искористете целобројно делење и остаток од делење.

#include <iostream>
using namespace std;

int main() {
    int date;
    cin >> date;
    int day;
    day = date / 1000000;
    int month = date / 10000 % 100;
    cout<<day<<"."<<month;
    return 0;
}