//
// Created by ema on 6.10.25.
//
// Задача 4
// Да се напише програма за пресметување на аритметичката средина на броевите 3, 5 и 12.

#include<iostream>
using namespace std;
int main() {
    int a=5, b=3, c=12;
    float ar;
    ar = (a+b+c)/3.0;
    cout << ar << endl;
    return 0;
}