//
// Created by ema on 9.11.25.
//
#include <iostream>
using namespace std;

// Од тастатура се внесува даден природен број N (каде N < 100000), и после него се внесуваат N други природни броеви. Да се најде сумата на цифрите кои се наоѓаат на првата (од десно на лево, односно цифрата на единици) позиција на првиот број, втората позиција на вториот број, потоа повторно првата позиција на третиот број, втората позиција на четвртиот број итн. Извлекувањето на цифрата од соодветната позиција (првата или втората позиција) да се имплементира во една посебна функција.
//
// Пример:
//
// 7
// 1234 234 5678 4567 45 7 6789
//
// Сума:
// 4 + 3 + 8 + 6 + 5 + 0 + 9 = 35

int getDigit(int num, bool position) {
    if (position) {
        return num % 10;
    }
    else {
        return num/10%10;
    }
}
int main() {
    int n;
    cin>>n;
    int num;
    int sum=0;
    for(int i=0; i<n; i++) {
        cin>>num;
        if(i%2==0) {
            sum+=getDigit(num,true);
        }
        else {
            sum+=getDigit(num,false);
        }
    }
    cout<<sum;
    return 0;
}
