//
// Created by ema on 9.11.25.
//
#include <iostream>
using namespace std;

// Да се напише програма во програмскиот јазик C++ во која од тастатура се внесува позитивен цел број N . Програмата треба да испечати таблица за множење (од 1 до 10) за најзначајната цифра на бројот N, но ако најзначајната цифра е парен број тогаш се печати таблицата за множење за најмалку значајната цифра. Форматот во кој треба да се испечатат таблиците може да се види во дадениот пример.
//
// Пример:
// N: 7562
//
// 7 * 1 = 7
// 7 * 2 = 14
// 7 * 3 = 21
// 7 * 4 = 28
// 7 * 5 = 35
// 7 * 6 = 42
// 7 * 7 = 49
// 7 * 8 = 56
// 7 * 9 = 63
// 7 * 10 = 70
int main() {
    int n;
    cin>>n;
    int temp=n;
    while(temp>10) {
        temp/=10;
    }
    if(temp%2==0) {
        for(int i=1; i<=10; i++) {
            cout<<n%10<<" * "<<i<<" = "<<(n%10)*i<<endl;
        }
    }
    else {
        for(int i=1; i<=10; i++) {
            cout<<temp<<" * "<<i<<" = "<<temp*i<<endl;
        }
    }
    return 0;
}
