//
// Created by ema on 9.11.25.
//
#include <iostream>
using namespace std;

// Да се напише програма со која се внесува цел број n (n>0) а потоа ја пресметува сумата на серијата (n*n) + …+ (3*3) + (2*2) + (1*1) но САМО за парните членови.
// На излезот се отпечатуваат парните членови, сумата и средната вредност на добиената серија од парните членови.
// Излезот е во дадениот формат (секој парен член, сумата и средната вредност во нови редови, нема празни места).

int main() {
    int n;
    cin>>n;
    int sum=0;
    int count=0;
    for(int i=n; i>0; i--) {
        if(i%2==0) {
            cout<<i<<"*"<<i<<"="<<i*i<<endl;
            sum+=i*i;
            count++;
        }
    }
    cout<<sum<<endl;
    cout<<sum*1.0/count<<endl;
    return 0;
}
