//
// Created by ema on 28.12.25.
//
#include<iostream>
#include<cstring>
#include <cctype>

using namespace std;

// Од стандарден влез се задаваат димензиите на една матрица Аmxn (m,n<=100) - бројот на колони во матрицата е >=3 , а во продолжение се читаат елементите на матрицата. Елементите на матрицата се цели броеви.
//
// За секој ред во матрицата, потребно е да се провери дали елементите се во строго растечки редослед на парните позиции и во строго опаѓачки редослед на непарните позиции. Ова треба да се одреди со помош на рекурзивна функција.
//
// Рекурзивната функција на влез прима низа од цели броеви и нејзината должина, а како резултат враќа 1 ако условот е задоволен, инаку 0.
//
// Програмата печати информации дали условот е исполнет или не за секој ред во матрицата. На крај, го печати А-индексот на матрицата што се пресметува како број на редици од матрицата за кои е исполнет условот.
//
// Максималниот број поени може да се добие само ако задачата се реши со рекурзивна функција. Ако задачата се реши со нерекурзивна функција, може да се дoбијат максимум 15 поени.
//
// Напомена: Парните позиции во рамките на еден ред се (индекс 0, индекс 2, индекс 4 итн.), додека непарните позиции во рамките на еден ред се (индекс 1, индекс 3, индекс 5 итн.)

int positionMatrix(int row[], int n, int pos) {
    if (pos >= n - 1) {
        return 1;
    } else {
        if (pos % 2 == 0) {
            if (pos + 2 < n && row[pos] >= row[pos + 2]) {
                return 0;
            }
        } else {
            if (pos + 2 < n && row[pos] <= row[pos + 2]) {
                return 0;
            }
        }
        return positionMatrix(row, n, pos + 1);
    }
}

int main() {
    int m, n;
    cin >> m >> n;
    int mat[100][100];

    for (int i = 0; i < m; i++) {
        for (int j = 0; j < n; j++) {
            cin >> mat[i][j];
        }
    }
    int index = 0;

    for (int i = 0; i < m; i++) {
        int res = positionMatrix(mat[i], n, 0);
        cout << "Row " << i << ": " << res << endl;
        index += res;
    }
    cout << "A-index: " << index << endl;
}
